Tekla Open API Reference for Tekla Structures 2025
ClashCheckData.Type Property
 Gets the type of the clash.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ClashCheckData.ClashTypeEnum Type { get; }
Public ReadOnly Property Type As ClashCheckData.ClashTypeEnum
	Get
Property Value
Type: ClashCheckData.ClashTypeEnum
See Also
Reference
ClashCheckData Class
Tekla.Structures.Model Namespace